#include "Game.h"

#define SEP "----------------------------------------------------------------------------------"
#define COL 78          //游戏界面的总宽度
#define MARGIN_L 20   //左边距
#define MAP_START_X 3
#define MAP_END_Y 11
#define INFO_START_Y 12
#define MAINMENU_START_Y 20


 /*
Prop propArray[] ={     //道具
    {1, "一字长蛇剑", 1, Weapon, 50, .minAttack=5,1000, "犹如巨蟒出击，攻击凌厉！"},
    {2, "二龙汲水珠", 2, Weapon, 10, .minAttack=10, 2000, "高度的灵活性，玄妙无比！"},
    {3, "三叉海神戟", 3, Weapon, 10, .minAttack=15, 3000, "重达十万八千斤，威力无穷！"},
    {4,"四方苦禅杖", 4, Weapon, 10, .minAttack=20, 4000, "极度彰显了少林作为中原武林第一大派和佛门贵地的崇高地位。"},
    {5, "五虎攒羊锤", 5, Weapon, 10, .minAttack=25, 5000, "唯有能与元素沟通的人可以唤醒它的真正力量。"},
    {6, "六合迎风枪", 6, Weapon, 10, .minAttack=30, 6000, "当年兵器谱排名第二，第一是小李他妈的飞刀！"},
    {7, "七星斩将矛", 7, Weapon, 10, .minAttack=40, 7000, "矛尖有如白蛇吐信，是令敌将闻风丧胆的象征！"},
    {8, "八卦金锁鞭", 8, Weapon, 10, .minAttack=50, 8000, "打在身上，仿佛是幻影涰连，遮日蔽天！"},
    {9, "九转乾坤圈", 9, Weapon, 10, .minAttack=90, 10000, "金色镯子，可翻江倒海，震荡乾坤！"},
    {100, "辟邪犀", 1, Armor, 10, .minDefense=5, 1000, "一块能解天下百毒的透明佩玉。"},
    {101, "乌蚕裙", 2, Armor, 10, .minDefense=15, 2000, "极其坚韧，刀枪不入，水火不侵！"},
    {102, "英姿带", 3, Armor, 10, .minDefense=20, 3000, "穿后精气饱满，神采飞扬，姿态英勇威风！"},
    {103, "天罡指", 4, Armor, 10, .minDefense=25, 4000, "飘忽不定，防东西至，防西东至！"},
    {104, "紫鲛衫", 5, Armor, 10, .minDefense=30, 5000, "海蛟皮制成，装备后可在水下呼吸！"},
    {105, "碧麟披", 6, Armor, 10, .minDefense=40, 6000, "上撰：上古南火朱雀之子,曾云字！"},
    {106, "金钟罩", 7, Armor, 10, .minDefense=45, 7000, "装备后有如金铸之钟覆罩全身，刀剑难损！"},
    {107, "防弹衣", 8, Armor, 10, .minDefense=60, 8000, "闯荡武林、居家必备！"},
    {108, "软猬甲", 9, Armor, 10, .minDefense=70, 10000, "刀枪不入还可保暖，穿在身上，妙用无穷。桃花岛的镇岛之宝！"},
    {201, "回复奶瓶(大)", 1, Consumables, 50, .maxPower=500, 2000, "一次性回复500点内力值。"}
};
        */
Map mapArray[8][8] ={
    {
    {1.1,"天山",1,{1,1},"这里充满了西域文化"},{1.2,"楼兰",1,{1,2},"这里充满了西域文化"},{1.3,"白驼山",1,{1,4},"这里充满了西域文化"},
    {1.4,"野猪林",1,{1,4},"这里充满了西域文化"},{1.5,"水晶洞",1,{1,5},"这里充满了西域文化"},{1.6,"天蚕洞",1,{1,6},"这里充满了西域文化"},
    {1.7,"黑风寨",1,{1,7},"这里充满了西域文化"},{1.8,"冰火岛",1,{1,8},"这里充满了西域文化"}
    },
    {
    {2.1,"迷宫",1,{0,0},"这里充满了西域文化"},{2.2,"凌霄城",1,{0,0},"这里充满了西域文化"},{2.3,"轩辕岭",1,{0,0},"这里充满了西域文化"},
    {2.4,"华山",1,{0,0},"这里充满了西域文化"},{2.5,"崇山",1,{0,0},"这里充满了西域文化"},{2.6,"紫禁城",1,{0,0},"这里充满了西域文化"},
    {2.7,"快活林",1,{0,0},"这里充满了西域文化"},{2.8,"神龙岛",1,{0,0},"这里充满了西域文化"}
    },
    {
    {3.1,"西域",1,{0,0},"这里充满了西域文化"},{3.2,"葫芦谷",1,{0,0},"这里充满了西域文化"},{3.3,"唐门",1,{0,0},"这里充满了西域文化"},
    {3.4,"终南山",1,{0,0},"这里充满了西域文化"},{3.5,"石窟",1,{0,0},"这里充满了西域文化"},{3.6,"客栈",1,{0,0},"这里充满了西域文化"},
    {3.7,"玉皇顶",1,{0,0},"这里充满了西域文化"},{3.8,"灵蛇岛",1,{0,0},"这里充满了西域文化"}
    },
    {
    {4.1,"光明顶",1,{0,0},"这里充满了西域文化"},{4.2,"摩天崖",1,{0,0},"这里充满了西域文化"},{4.3,"聚贤庄",1,{0,0},"这里充满了西域文化"},
    {4.4,"后山",1,{0,0},"这里充满了西域文化"},{4.5,"武当山",1,{0,0},"这里充满了西域文化"},{4.7,"开封府",1,{0,0},"这里充满了西域文化"},
    {4.7,"二十四桥",1,{0,0},"这里充满了西域文化"},{4.8,"蓬莱仙境",1,{0,0},"这里充满了西域文化"}
    },
    {
    {5.1,"擂鼓山",1,{0,0},"这里充满了西域文化"},{5.2,"峨眉山",1,{0,0},"这里充满了西域文化"},{5.3,"迷踪林",1,{0,0},"这里充满了西域文化"},
    {5.4,"五虎岭",1,{0,0},"这里充满了西域文化"},{5.5,"天宁寺",1,{0,0},"这里充满了西域文化"},{5.6,"积善堂",1,{0,0},"这里充满了西域文化"},
    {5.7,"镇江府",1,{0,0},"这里充满了西域文化"},{5.8,"桃花岛",1,{0,0},"这里充满了西域文化"}
    },
    {
    {6.1,"恶人谷",1,{0,0},"这里充满了西域文化"},{6.2,"大理",1,{0,0},"这里充满了西域文化"},{6.3,"百花谷",1,{0,0},"这里充满了西域文化"},
    {6.4,"孔雀山庄",1,{0,0},"这里充满了西域文化"},{6.5,"五霸岗",1,{0,0},"这里充满了西域文化"},{6.6,"万仞堂",1,{0,0},"这里充满了西域文化"},
    {6.7,"千年古刹",1,{0,0},"这里充满了西域文化"},{6.8,"六合塔",1,{0,0},"这里充满了西域文化"}
    },
    {
    {7.1,"玩偶庄",1,{0,0},"这里充满了西域文化"},{7.2,"黑木崖",1,{0,0},"这里充满了西域文化"},{7.3,"蝴蝶谷",1,{0,0},"这里充满了西域文化"},
    {7.4,"铁花堡",1,{0,0},"这里充满了西域文化"},{7.5,"霹雳堂",1,{0,0},"这里充满了西域文化"},{7.6,"关帝庙",1,{0,0},"这里充满了西域文化"},
    {7.7,"麒麟庄",1,{0,0},"这里充满了西域文化"},{7.8,"镇魂宫",1,{0,0},"这里充满了西域文化"}
    },
    {
    {8.1,"石府",1,{0,0},"这里充满了西域文化"},{8.2,"金三角",1,{0,0},"这里充满了西域文化"},{8.3,"忏悔崖",1,{0,0},"这里充满了西域文化"},
    {8.4,"通吃岛",1,{0,0},"这里充满了西域文化"},{8.5,"通天观",1,{0,0},"这里充满了西域文化"},{8.6,"紫霞亭",1,{0,0},"这里充满了西域文化"},
    {8.7,"天弃庵",1,{0,0},"这里充满了西域文化"},{8.8,"侠客岛",1,{0,0},"这里充满了西域文化"}
    }
};
    /*
Martial martials[] ={
    {1, "少林派",   "正派", .hqCoord.X=1, .hqCoord.Y=4, 1, "中华武学的泰斗，明末，少林众多的人才中，以悟空和箭神二人排为一等。其中，悟空出家为僧，箭神乃俗家弟子。当时江湖人称少林双绝。少林寺中众僧在两大长老的带领下参加了江浙沿海抗击倭寇的战斗，在各路应募兵马中表现得最为骁勇。但正因抗倭之事，也使江湖中的众多门派产生了矛盾，其中首推少林和日月神教。悟空、箭神曾几度带领江湖同仁攻上光明顶，但由于日月神教和血河两派结为同盟，更何况邪派中高手如云，所以几次围剿未果而终，黑白两道都损失惨重"},
    {2, "武当派",   "正派", .hqCoord.X=3, .hqCoord.Y=4, 1, "武当在江湖上与少林齐名，有‘北崇少林’‘南尊武当’之说。 武当新一代的首领人物，是一位谦谦君子，一张轮廓分明的脸上总是带着爽朗的笑容，就连他的仇敌都不能不承认他是条少见的男子汉。凡人从十八岁崛起江湖，身经大小三十三战，至今从未败过一次。凡人一生中最不能忍受的两件事就是失败和错误。 "},
    {3, "丐帮",     "正派", .hqCoord.X=2, .hqCoord.Y=6, 1, "丐帮是中原武林中人数最为众多的一个门派，也是天下第一大帮派，以遍布天下乞丐的乞丐组成，分为污衣帮和净衣帮。丐帮中人大多都是社会地位比较低的人，但他们各个铮铮硬骨，品格高尚，很少出现卑劣之人。丐帮新一代众多弟子以天葵为首，除暴安良、行侠丈义、抑强扶弱，所作所为为天下人所津津乐道。"},
    {4, "全真教",   "正派", .hqCoord.X=2, .hqCoord.Y=3, 1, "全真属于道教的分支之一。现今全真教中最有权威的人是一个瘦瘦小小的人，长着一双冷冷淡淡好象永远不会有什么变化的眼睛，看起来仿佛是灰色的。但他又是一个非常讲究的人，他喜欢紫色，喜欢名马佳人华衣美酒，喜欢享受。对每一件事情他都非常的挑剔，做的每一件事都经过精密计划，绝不肯多浪费一分力气，也不会有一点疏忽。这就是全真海雅。"},
    {5, "五岳剑派", "正派", .hqCoord.X=1, .hqCoord.Y=3, 1, "泰山派，恒山派，衡山派，华山派，嵩山派结为同气枝连的的五岳剑派，在江湖上扬名立万。五派中人一向面和心不和，所以五派的式微不是由于外敌入侵，而纯粹是内部矛盾激化走向内耗的结果，内部的勾心斗角虽然常常以抗倭为借口出现，实则是为了掌握五岳生杀大权。"},
    {6, "四川唐门", "正派", .hqCoord.X=2, .hqCoord.Y=2, 1, "唐门在江湖上以暗器闻名。但自从唐门的唐老太太过世后唐家堡一度家道中落，加之唐甜为称霸武林挑起纷争，又使唐门陷入了再度的浩劫，几乎一蹶不振。在这种危难的时刻唐门出现了一群新生力量：唐纾、唐斩、唐缺、唐玉。他们整顿内务，肃清奸佞，打出了匡复武林正义的旗帜，并且在江湖上行侠仗义，挽回了唐门的声誉，使唐门成为了江湖上的名门正派。"},
    {7, "大理段氏", "正派", .hqCoord.X=5, .hqCoord.Y=1, 1, "大理段氏人丁众多，高手如云。其中有一位名扬江湖顶尖女侠——香雪儿。香雪儿面相灵秀，肤色白皙，但微显瘦弱，看上去弱不禁风却身怀绝世武功，已深得大理武功心得。"},
    {8, "天山派",   "正派", .hqCoord.X=0, .hqCoord.Y=0, 1, "天山派是名门正派，也是目前江湖中最为团结的一个门派。天山派也是江湖中女弟子最为众多的一个门派，且各个武功造诣不凡，相貌清秀。"},
    {9, "古墓派",   "正派", .hqCoord.X=3, .hqCoord.Y=3, 1, "古墓派这一代的传人名叫暄雯，是一女子，来历不明。暄雯生性娴静，长相俊美，举止飘逸，但做事情却不似师祖小龙女，倒颇有一点杨过的风格，武功修为深不可测，同样喜穿白衣。此派轻功卓越，剑法、拳法灵动妙绝，更是全真教的克星。古墓传人的处世原则是“事不关己，高高挂起”，过着与世无争的日子，但是如果有人冒犯了古墓传人，那他一定会死得很惨。"},
    {10, "名捕门",  "正派", .hqCoord.X=1, .hqCoord.Y=1, 1, "名捕门历属与官府，但其中也不乏在江湖上闯出名堂的武林高手。名捕门一等一的人才中有一位绰号叫‘惊天泣鬼’的，此人从不以真面目视人，总是在幕后策划一些事情。"},
    {11, "日月神教","邪派", .hqCoord.X=6, .hqCoord.Y=1, 1, "由于该教高手众多，并彼此互不相服，所以教务混杂。教中弟子多为邪恶之徒，专与名门正派作对，杀人良多，罪恶昭彰，故被江湖正派之人贬为魔教。"},
    {12, "权力帮",  "邪派", .hqCoord.X=4, .hqCoord.Y=0, 1, "邪派之一，目前派中最高首脑为一叫阿飞的年轻人。阿飞，一个表面上异常忧悒的人。没有与其交过手的武林高手，无法想象他那弱不禁风的身躯隐藏着那么大的潜力，更不能想象他是如何用支撑起权利帮的担子的。"},
    {13, "五毒教",  "邪派", .hqCoord.X=2, .hqCoord.Y=0, 1, "一个以使毒为专长的门派，派中人各个都是用毒高手。此派高手人称梦魇，其人使毒已入化境，令人难以琢磨，江湖同道对其莫不绕道而行。此人品行时好时坏，但坚韧卓绝，嗜武成痴。"},
    {14, "神龙教",  "邪派", .hqCoord.X=2, .hqCoord.Y=7, 1, "神龙教是江湖邪派，由于教址远离中原，所以不大干预中原武林的血腥杀戮。目前神龙教有两位高手一为刀神，此人武功高深莫测，性格孤僻冷傲，不喜与人接近。二为恶龙，武功高强但脾气暴躁，做事没有耐性。"},
    {15, "青龙会",  "邪派", .hqCoord.X=5, .hqCoord.Y=6, 1, "江湖上绵延数百年的一个神秘组织。青龙会下分十二堂，分别以月为代号。"},
    {16, "桃花岛",  "亦正亦邪", .hqCoord.X=4, .hqCoord.Y=7, 1, "自从东邪黄药师扬名立万于此后，他的传人就在这里绵延不绝，竟将桃花岛建成了门派的总舵。桃花岛黄药师的关门弟子程英一生未嫁，在岛上收了几个徒弟，桃花岛的武功因此得到延续和发扬。"},
    {17, "锦衣卫",  "亦正亦邪", .hqCoord.X=1, .hqCoord.Y=5, 1, "大内锦衣卫中人才济济，尤其是雷神，此人野心勃勃，自幼练得一身大力金刚功，号称刀枪不入，武功实是深不可测。而且为人机智，精通兵法，行兵时能将千军万马人使得如同数十万般威力十足。"},
    {18, "血河派",  "亦正亦邪", .hqCoord.X=5, .hqCoord.Y=0, 1, "自从血河派的掌门一代大侠方歌吟飘然而去后，血河派日益衰落。血河派活动的范围也越来越少，基本上只限与龙门石窟。而江湖上的九大门派已经把血河派视为邪魔歪道。并已传出英雄令，只要九大门派的门人遇上血河派的人，一律格杀无论。在江湖上已经没有什么血河派的人在行走。除了无恨！没有人知道他来自何方，人们只知道他来自血河派。没有人知道他的武功有多高，因为看见他的剑的人都已经......无恨是武林中的一个谜，现隐居在天山，相传是为了一名叫若寒的女子。相传血河弟子花无缺已深得无恨真传，在无恨隐居江湖期间代理血河的一切帮中事务。花无缺为人善良真诚，在江湖上人缘甚好，并将血河派内外事务打理得井井有条。"},
    {19, "通通吃",  "亦正亦邪", .hqCoord.X=7, .hqCoord.Y=3, 1, "江湖上一个神秘的门派，创始人，武功不祥。总舵设在通吃岛，教中首领人物——辉翰。此人手段严酷，以威服人。平常不轻易踏足中原武林，潜心修炼武功。"},
    {20, "玩偶山庄","亦正亦邪", .hqCoord.X=0, .hqCoord.Y=6, 1, "江湖上一个神秘的门派，创始人，武功不祥。总舵就在玩偶山庄，教中首领人物——阳光。玩偶山庄门人众多，但大都绝迹江湖，只有阳光经常独自浪迹江湖并闯出了名堂，所以武林中人才知有这么一个门派存在。"}
};

Monster monsters[] = {  /* 游戏中的怪物 */   /*
    {1, "鬼子", 1, 100, 5, 5, 1, 3, 10, 1, .mCoord.X=0, .mCoord.Y=0},
    {1, "鬼子", 1, 100, 5, 5, 1, 3, 10, 1, .mCoord.X=0, .mCoord.Y=1},
    {1, "鬼子", 1, 100, 5, 5, 1, 3, 10, 1, .mCoord.X=0, .mCoord.Y=2},
    {1, "鬼子", 1, 100, 5, 5, 1, 3, 10, 1, .mCoord.X=0, .mCoord.Y=3},
    {1, "鬼子", 1, 100, 5, 5, 1, 3, 10, 1, .mCoord.X=0, .mCoord.Y=4},
    {1, "鬼子", 1, 100, 5, 5, 1, 3, 10, 1, .mCoord.X=0, .mCoord.Y=5},
    {1, "鬼子", 1, 100, 5, 5, 1, 3, 10, 1, .mCoord.X=0, .mCoord.Y=6},
    {1, "鬼子", 1, 100, 5, 5, 1, 3, 10, 1, .mCoord.X=0, .mCoord.Y=7},
    {2, "汉奸", 2, 200, 8, 12, 1, 8, 11, 1, .mCoord.X=0, .mCoord.Y=0},
    {2, "汉奸", 2, 200, 8, 12, 1, 8, 11, 1, .mCoord.X=0, .mCoord.Y=1},
    {2, "汉奸", 2, 200, 8, 12, 1, 8, 11, 1, .mCoord.X=0, .mCoord.Y=2},
    {2, "汉奸", 2, 200, 8, 12, 1, 8, 11, 1, .mCoord.X=0, .mCoord.Y=3},
    {2, "汉奸", 2, 200, 8, 12, 1, 8, 11, 1, .mCoord.X=0, .mCoord.Y=4},
    {2, "汉奸", 2, 200, 8, 12, 1, 8, 11, 1, .mCoord.X=0, .mCoord.Y=5},
    {2, "汉奸", 2, 200, 8, 12, 1, 8, 11, 1, .mCoord.X=0, .mCoord.Y=6},
    {2, "汉奸", 2, 200, 8, 12, 1, 8, 11, 1, .mCoord.X=0, .mCoord.Y=7},
    {3, "浪人", 3, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=0},
    {3, "浪人", 3, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=1},
    {3, "浪人", 3, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=2},
    {3, "浪人", 3, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=3},
    {3, "浪人", 3, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=4},
    {3, "浪人", 3, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=5},
    {3, "浪人", 3, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=6},
    {3, "浪人", 5, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=6},
    {3, "浪人", 6, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=6},
    {3, "浪人", 7, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=6},
    {3, "浪人", 8, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=6},
    {3, "浪人", 9, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=6},
    {3, "浪人", 9, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=6},
    {3, "浪人", 9, 300, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=6},
    {3, "浪人", 9, 30000, 10, 10, 3, 8, 20, 1, .mCoord.X=0, .mCoord.Y=6}
};
 */

Player players[] = {
    {9526, "gm1", "gm1", 5, 1, 1, 10000, 30000, 1000, 10000, .currCoord.X=0, .currCoord.Y=0},
    {9527, "华安", "an.hua", 5, 8, 1, 1000000, 300000, 99999, 1000000, .currCoord.X=2, .currCoord.Y=2}
};

     /*
void ShowProp()    //显示道具
{
    int propCount = sizeof(propArray)/sizeof(Prop);
    int i;
    for(i=0;i<propCount;i++)
    {
        printf("%d\t%s\t%.0lf\n",propArray[i].id,propArray[i].name,propArray[i].price);
        switch(propArray[i].type)
        {
        case Weapon:    //武器
            printf("最小攻击力；%d\t最大攻击力：%d\n",propArray[i].minAttack,propArray[i].maxAttack);
            break;
        case Armor:
            printf("最小防御力；%d\t最大防御力：%d\n",propArray[i].minDefence,propArray[i].maxDefence);
            break;
        }
    }

}     */       /*
void ShowPlayer(int i)
{
    printf("玩家%s信息：\n",players[i].name);
    printf("HP:%d\n",players[i].hp);
    printf("MP:%d\n",players[i].mp);
    printf("剩余生命数\n",players[i].life);

}    */

void ShowWelcome()
{

    //SetPostion(MARGIN_L,0);
    printf("%s\n",SEP);
    //SetPostion(MARGIN_L,1);
    printf("|                                欢迎来到《笑傲江湖之精忠报国》                  |\n");
    //SetPostion(MARGIN_L,2);
    printf("%s\n",SEP);
}
void ShowMap()
{
    //要根据当前玩家的坐标来显示地图的文字
    int i,j,n;
    for(i=0;i<8;i++)
    {
        n=3+i;
        //SetPostion(MARGIN_L,n);
        for(j=0;j<8;j++)
        {
            if(j==0)
                printf("|");
            //if(i==Y && j==X)
            //{
            //    SetColor(5,15);
            //}
            printf("%-10s",mapArray[i][j].name);
            //SetColor(10,0);                 //打印完特殊地图后将颜色变回默认颜色
        }
        printf("|\n");
    }
    //SetPostion(MARGIN_L,n+1);
    printf("%s\n",SEP);
    //printf("请输入选择或是方向移动：");
}

void ShowInformation()
{
    //SetPostion(MARGIN_L,INFO_START_Y);
    int i;
    for(i=0;i<7;i++)
    {
        //SetPostion(MARGIN_L,INFO_START_Y+i);
        printf("|");
        //SetPostion(MARGIN_L+81,INFO_START_Y+i);
        printf("|");
    }
    //SetPostion(MARGIN_L,INFO_START_Y+7);
    printf("%s",SEP);
}

void ShowMainMenu()
{
    //SetPostion(MARGIN_L,MAINMENU_START_Y);
    printf("1、自我欣赏\n");
    //SetPostion(MARGIN_L,MAINMENU_START_Y+1);
    printf("2、探查\n") ;
    //SetPostion(MARGIN_L,MAINMENU_START_Y+2);
    printf("3、回总部\n") ;
    //SetPostion(MARGIN_L,MAINMENU_START_Y+3);
    printf("4、购买装备\n") ;
    //SetPostion(MARGIN_L,MAINMENU_START_Y+4);
    printf("5、举目张望\n") ;
    //SetPostion(MARGIN_L,MAINMENU_START_Y+5);
    printf("6、到此一游\n") ;
    //SetPostion(MARGIN_L,MAINMENU_START_Y+6);
    printf("7、退出游戏\n") ;
    //SetPostion(MARGIN_L,MAINMENU_START_Y+7);
    printf("请输入选择或是方向移动：");
    //SetPostion(MARGIN_L,MAINMENU_START_Y+8);
}







