#include <stdio.h>
#include <stdlib.h>
#define N 5
int main()
{
    /*冒泡排序
    基本原理：遍历和交换
    16  25  9   90  23
    第一轮循环：
    1.  25  16  9   90  23
    2.  25  16  9   90  23
    3.  25  16  90  9   23
    4.  25  16  90  23  9           最小的数字就到了最后
    需要比较多轮
    第一轮比较了4次    （数组的长度-1）
    第二轮循环
    1.  25  16  90  23  9
    2.  25  90  16  23  9
    3.  25  90  23  16  9
    第二轮比较了3次
    第一轮少一次
    （数组长度-1）-当前轮数
    */
    int nums[N]={16,25,9,90,23};
    int i,j;            //循环变量
    int temp;           //用来交换的临时变量
    //外层循环控制轮数
    for(i=0;i<N-1;i++)
    {
        //内层循环控制每轮比较次数
        for(j=0;j<N-i-1;j++)
        {
            //如果当前值小于后面一个值，就交换
            if(nums[j] < nums[j+1])
            {
                temp=nums[j];
            nums[j]=nums[j+1];
            nums[j+1]=temp;
            }

        }
    }
    printf("排序后的结果：\n");
    for(i=0;i<N;i++)
    {
        printf("%d\t",nums[i]);
    }
    return 0;
}












